Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamEnum
The composite beam options.

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamEnum.COMPOSITE_BEAM_NOT
The composite beam setting "not".

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamEnum.COMPOSITE_BEAM_YES
The composite beam setting "yes".

Tekla.Structures.Analysis.AnalysisPartCompositeProperties.CompositeBeamEnum.COMPOSITE_BEAM_AUTOMATIC
The composite beam setting "automatic".